<a href="https://colab.research.google.com/github/davesohamm/Nirma-Practical/blob/branch-2/AML/Ex_3_AML.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

I have Uploaded the titanic xlsx file to the "/content/sample_data/titanic.xlsx" path on this Google Colab Notebook. So this path will be used to perform the practical.
also i have uploaded it on google drive, link is : https://docs.google.com/spreadsheets/d/14Ey6wsSORvFqwaORyYdTKPajubvUlqmh/edit?usp=drive_link&ouid=103048145379356597986&rtpof=true&sd=true

In [40]:
pip install pandas

Requirement already satisfied: pandas in /usr/local/lib/python3.11/dist-packages (2.2.2)
Requirement already satisfied: numpy>=1.23.2 in /usr/local/lib/python3.11/dist-packages (from pandas) (2.0.2)
Requirement already satisfied: python-dateutil>=2.8.2 in /usr/local/lib/python3.11/dist-packages (from pandas) (2.9.0.post0)
Requirement already satisfied: pytz>=2020.1 in /usr/local/lib/python3.11/dist-packages (from pandas) (2025.2)
Requirement already satisfied: tzdata>=2022.7 in /usr/local/lib/python3.11/dist-packages (from pandas) (2025.2)
Requirement already satisfied: six>=1.5 in /usr/local/lib/python3.11/dist-packages (from python-dateutil>=2.8.2->pandas) (1.17.0)

In [41]:
import pandas as pd

In [42]:
data = pd.read_excel("/content/sample_data/titanic.xlsx")

To read excel file which is in any folder, we use r' ' before the PATH name :

In [43]:
data = pd.read_excel(r'/content/sample_data/titanic.xlsx')

We can also read any sheet of given excel file using there sheet name or number :

In [44]:
data = pd.read_excel(r'/content/sample_data/titanic.xlsx', sheet_name = 0)

For the titanic dataset, we do not have multiple sheets inside the excel file. otherwise we could have used methods like :

data = pd.read_excel(r'/content/sample_data/titanic.xlsx', sheet_name = 1)

data = pd.read_excel(r'/content/sample_data/titanic.xlsx', sheet_name = 0)

data = pd.read_excel(r'/content/sample_data/titanic.xlsx', sheet_name = 'Sheet2')

data = pd.read_excel(r'/content/sample_data/titanic.xlsx', sheet_name = 'Titanic')

To display selected columns, we can use these two methods :

In [45]:
print(pd.DataFrame(data, columns=['Name', 'Survived']))

                                                  Name  Survived
0                              Braund, Mr. Owen Harris         0
1    Cumings, Mrs. John Bradley (Florence Briggs Th...         1
2                               Heikkinen, Miss. Laina         1
3         Futrelle, Mrs. Jacques Heath (Lily May Peel)         1
4                             Allen, Mr. William Henry         0
..                                                 ...       ...
886                              Montvila, Rev. Juozas         0
887                       Graham, Miss. Margaret Edith         1
888           Johnston, Miss. Catherine Helen "Carrie"         0
889                              Behr, Mr. Karl Howell         1
890                                Dooley, Mr. Patrick         0

[891 rows x 2 columns]

NOTE - DataFrame function have to be written in this way only. the letter D and F are capital, keep it in mind.

In [46]:
print(data[['Name', 'Survived']])

                                                  Name  Survived
0                              Braund, Mr. Owen Harris         0
1    Cumings, Mrs. John Bradley (Florence Briggs Th...         1
2                               Heikkinen, Miss. Laina         1
3         Futrelle, Mrs. Jacques Heath (Lily May Peel)         1
4                             Allen, Mr. William Henry         0
..                                                 ...       ...
886                              Montvila, Rev. Juozas         0
887                       Graham, Miss. Margaret Edith         1
888           Johnston, Miss. Catherine Helen "Carrie"         0
889                              Behr, Mr. Karl Howell         1
890                                Dooley, Mr. Patrick         0

[891 rows x 2 columns]

If you want to see only 5 top rows of the selected columns, use head() method :

In [47]:
print(data[['Name', 'Survived']].head())

                                                Name  Survived
0                            Braund, Mr. Owen Harris         0
1  Cumings, Mrs. John Bradley (Florence Briggs Th...         1
2                             Heikkinen, Miss. Laina         1
3       Futrelle, Mrs. Jacques Heath (Lily May Peel)         1
4                           Allen, Mr. William Henry         0

In similar way, use tail() for bottom 5 values :

In [48]:
print(data[['Name', 'Survived']].tail())

                                         Name  Survived
886                     Montvila, Rev. Juozas         0
887              Graham, Miss. Margaret Edith         1
888  Johnston, Miss. Catherine Helen "Carrie"         0
889                     Behr, Mr. Karl Howell         1
890                       Dooley, Mr. Patrick         0

You can also display columns using dot operator :

In [49]:
print(data.Name,data.Survived)

0                                Braund, Mr. Owen Harris
1      Cumings, Mrs. John Bradley (Florence Briggs Th...
2                                 Heikkinen, Miss. Laina
3           Futrelle, Mrs. Jacques Heath (Lily May Peel)
4                               Allen, Mr. William Henry
                             ...
886                                Montvila, Rev. Juozas
887                         Graham, Miss. Margaret Edith
888             Johnston, Miss. Catherine Helen "Carrie"
889                                Behr, Mr. Karl Howell
890                                  Dooley, Mr. Patrick
Name: Name, Length: 891, dtype: object 0      0
1      1
2      1
3      1
4      0
      ..
886    0
887    1
888    0
889    1
890    0
Name: Survived, Length: 891, dtype: int64

As you can see, this will create two separate series of values for each columns .

To import dataset from the URLs you can simply just mention the link in the read_csv function :

In [50]:
url = 'https://calmcode.io/static/data/titanic.csv'
data = pd.read_csv(url)
print(data)

     survived  pclass                                               name  \
0           0       3                            Braund, Mr. Owen Harris
1           1       1  Cumings, Mrs. John Bradley (Florence Briggs Th...
2           1       3                             Heikkinen, Miss. Laina
3           1       1       Futrelle, Mrs. Jacques Heath (Lily May Peel)
4           0       3                           Allen, Mr. William Henry
..        ...     ...                                                ...
709         0       3               Rice, Mrs. William (Margaret Norton)
710         0       2                              Montvila, Rev. Juozas
711         1       1                       Graham, Miss. Margaret Edith
712         1       1                              Behr, Mr. Karl Howell
713         0       3                                Dooley, Mr. Patrick

        sex   age     fare  sibsp  parch
0      male  22.0   7.2500      1      0
1    female  38.0  71.2833      1      0
2    female  26.0   7.9250      0      0
3    female  35.0  53.1000      1      0
4      male  35.0   8.0500      0      0
..      ...   ...      ...    ...    ...
709  female  39.0  29.1250      0      5
710    male  27.0  13.0000      0      0
711  female  19.0  30.0000      0      0
712    male  26.0  30.0000      0      0
713    male  32.0   7.7500      0      0

[714 rows x 8 columns]

In [51]:
data = pd.read_csv(url, sep=';')
print(data)

         survived,pclass,name,sex,age,fare,sibsp,parch
0     0,3,"Braund, Mr. Owen Harris",male,22.0,7.25,1,0
1    1,1,"Cumings, Mrs. John Bradley (Florence Brig...
2    1,3,"Heikkinen, Miss. Laina",female,26.0,7.925...
3    1,1,"Futrelle, Mrs. Jacques Heath (Lily May Pe...
4    0,3,"Allen, Mr. William Henry",male,35.0,8.05,0,0
..                                                 ...
709  0,3,"Rice, Mrs. William (Margaret Norton)",fem...
710     0,2,"Montvila, Rev. Juozas",male,27.0,13.0,0,0
711  1,1,"Graham, Miss. Margaret Edith",female,19.0...
712     1,1,"Behr, Mr. Karl Howell",male,26.0,30.0,0,0
713       0,3,"Dooley, Mr. Patrick",male,32.0,7.75,0,0

[714 rows x 1 columns]

This code snippet reads data from a CSV file located at the specified URL into a pandas DataFrame. The sep=';' argument tells pandas to use a semicolon as the delimiter between values in the CSV file, instead of the default comma.

readind data using column names explicitly :

In [52]:
data = pd.read_csv(url, names=['col1', 'col2', 'col3', 'col4', 'col5', 'col6', 'col7', 'col8'])

print(data.head())

       col1    col2                                               col3  \
0  survived  pclass                                               name
1         0       3                            Braund, Mr. Owen Harris
2         1       1  Cumings, Mrs. John Bradley (Florence Briggs Th...
3         1       3                             Heikkinen, Miss. Laina
4         1       1       Futrelle, Mrs. Jacques Heath (Lily May Peel)

     col4  col5     col6   col7   col8
0     sex   age     fare  sibsp  parch
1    male  22.0     7.25      1      0
2  female  38.0  71.2833      1      0
3  female  26.0    7.925      0      0
4  female  35.0     53.1      1      0

read data using any column as an index :

In [53]:
data = pd.read_csv(url, index_col = 0)
print(data)

          pclass                                               name     sex  \
survived
0              3                            Braund, Mr. Owen Harris    male
1              1  Cumings, Mrs. John Bradley (Florence Briggs Th...  female
1              3                             Heikkinen, Miss. Laina  female
1              1       Futrelle, Mrs. Jacques Heath (Lily May Peel)  female
0              3                           Allen, Mr. William Henry    male
...          ...                                                ...     ...
0              3               Rice, Mrs. William (Margaret Norton)  female
0              2                              Montvila, Rev. Juozas    male
1              1                       Graham, Miss. Margaret Edith  female
1              1                              Behr, Mr. Karl Howell    male
0              3                                Dooley, Mr. Patrick    male

           age     fare  sibsp  parch
survived
0         22.0   7.2500      1      0
1         38.0  71.2833      1      0
1         26.0   7.9250      0      0
1         35.0  53.1000      1      0
0         35.0   8.0500      0      0
...        ...      ...    ...    ...
0         39.0  29.1250      0      5
0         27.0  13.0000      0      0
1         19.0  30.0000      0      0
1         26.0  30.0000      0      0
0         32.0   7.7500      0      0

[714 rows x 7 columns]

To get selected columns data from csv file use this method :

In [54]:
data = pd.read_csv(url, usecols=[1,3,4])
print(data)

     pclass     sex   age
0         3    male  22.0
1         1  female  38.0
2         3  female  26.0
3         1  female  35.0
4         3    male  35.0
..      ...     ...   ...
709       3  female  39.0
710       2    male  27.0
711       1  female  19.0
712       1    male  26.0
713       3    male  32.0

[714 rows x 3 columns]

Prefix to add to column numbers when no header is available :

In [55]:
data = pd.read_csv(url, header=None, names=[f'Column{i}' for i in range(8)])
print(data.head())

    Column0 Column1                                            Column2  \
0  survived  pclass                                               name
1         0       3                            Braund, Mr. Owen Harris
2         1       1  Cumings, Mrs. John Bradley (Florence Briggs Th...
3         1       3                             Heikkinen, Miss. Laina
4         1       1       Futrelle, Mrs. Jacques Heath (Lily May Peel)

  Column3 Column4  Column5 Column6 Column7
0     sex     age     fare   sibsp   parch
1    male    22.0     7.25       1       0
2  female    38.0  71.2833       1       0
3  female    26.0    7.925       0       0
4  female    35.0     53.1       1       0

To skip the rows we can use skiprows method, in pandas :

In [56]:
data = pd.read_csv(url, skiprows=2)
print(data.head())

   1  1.1 Cumings, Mrs. John Bradley (Florence Briggs Thayer)  female  38.0  \
0  1    3                             Heikkinen, Miss. Laina   female  26.0
1  1    1       Futrelle, Mrs. Jacques Heath (Lily May Peel)   female  35.0
2  0    3                           Allen, Mr. William Henry     male  35.0
3  0    1                            McCarthy, Mr. Timothy J     male  54.0
4  0    3                     Palsson, Master. Gosta Leonard     male   2.0

   71.2833  1.2  0
0   7.9250    0  0
1  53.1000    1  0
2   8.0500    0  0
3  51.8625    0  0
4  21.0750    3  1

as you can see, 2 rows are skipped.

we can select specific columns, and skip even rows, for that we will write :

In [57]:
data = pd.read_csv(url, usecols=[1,3,4], skiprows=lambda x:x%2==0)
print(data)

     3    male  22.0
0    3  female  26.0
1    3    male  35.0
2    3    male   2.0
3    2  female  14.0
4    1  female  58.0
..  ..     ...   ...
351  2  female  25.0
352  3  female  22.0
353  3    male  25.0
354  2    male  27.0
355  1    male  26.0

[356 rows x 3 columns]

as you can see, we used custom function (lambda) to skip the even rows with a logic.



The `skipfooter` argument allows you to skip a specified number of rows at the end of the file. This is useful when your file contains summary rows or other data you don't want to include in your DataFrame.

In [58]:

url = 'https://calmcode.io/static/data/titanic.csv'

data_skipfooter = pd.read_csv(url, skipfooter=5, engine='python')
print("Data after skipping last 5 rows:")
print(data_skipfooter.tail())

Data after skipping last 5 rows:
     survived  pclass                                          name     sex  \
704         1       2  Shelley, Mrs. William (Imanita Parrish Hall)  female
705         0       3                            Markun, Mr. Johann    male
706         0       3                  Dahlberg, Miss. Gerda Ulrika  female
707         0       2                 Banfield, Mr. Frederick James    male
708         0       3                        Sutehall, Mr. Henry Jr    male

      age     fare  sibsp  parch
704  25.0  26.0000      0      1
705  33.0   7.8958      0      0
706  22.0  10.5167      0      0
707  28.0  10.5000      0      0
708  25.0   7.0500      0      0



The `nrows` argument allows you to read only a specified number of rows from the beginning of the file. This is particularly useful for reading large files in chunks or for quickly inspecting the structure of a large dataset without loading the entire file into memory.

In [59]:
# Using nrows with read_excel
data_nrows_excel = pd.read_excel("/content/sample_data/titanic.xlsx", nrows=10)
print("\nData after reading only the first 10 rows (Excel):")
print(data_nrows_excel)

# Using nrows with read_csv
url = 'https://calmcode.io/static/data/titanic.csv'
data_nrows_csv = pd.read_csv(url, nrows=10)
print("\nData after reading only the first 10 rows (CSV):")
print(data_nrows_csv)

Data after reading only the first 10 rows (Excel):
   PassengerId  Survived  Pclass  \
0            1         0       3
1            2         1       1
2            3         1       3
3            4         1       1
4            5         0       3
5            6         0       3
6            7         0       1
7            8         0       3
8            9         1       3
9           10         1       2

                                                Name     Sex   Age  SibSp  \
0                            Braund, Mr. Owen Harris    male  22.0      1
1  Cumings, Mrs. John Bradley (Florence Briggs Th...  female  38.0      1
2                             Heikkinen, Miss. Laina  female  26.0      0
3       Futrelle, Mrs. Jacques Heath (Lily May Peel)  female  35.0      1
4                           Allen, Mr. William Henry    male  35.0      0
5                                   Moran, Mr. James    male   NaN      0
6                            McCarthy, Mr. Timothy J    male  54.0      0
7                     Palsson, Master. Gosta Leonard    male   2.0      3
8  Johnson, Mrs. Oscar W (Elisabeth Vilhelmina Berg)  female  27.0      0
9                Nasser, Mrs. Nicholas (Adele Achem)  female  14.0      1

   Parch            Ticket     Fare Cabin Embarked
0      0         A/5 21171   7.2500   NaN        S
1      0          PC 17599  71.2833   C85        C
2      0  STON/O2. 3101282   7.9250   NaN        S
3      0            113803  53.1000  C123        S
4      0            373450   8.0500   NaN        S
5      0            330877   8.4583   NaN        Q
6      0             17463  51.8625   E46        S
7      1            349909  21.0750   NaN        S
8      2            347742  11.1333   NaN        S
9      0            237736  30.0708   NaN        C

Data after reading only the first 10 rows (CSV):
   survived  pclass                                               name  \
0         0       3                            Braund, Mr. Owen Harris
1         1       1  Cumings, Mrs. John Bradley (Florence Briggs Th...
2         1       3                             Heikkinen, Miss. Laina
3         1       1       Futrelle, Mrs. Jacques Heath (Lily May Peel)
4         0       3                           Allen, Mr. William Henry
5         0       1                            McCarthy, Mr. Timothy J
6         0       3                     Palsson, Master. Gosta Leonard
7         1       3  Johnson, Mrs. Oscar W (Elisabeth Vilhelmina Berg)
8         1       2                Nasser, Mrs. Nicholas (Adele Achem)
9         1       3                    Sandstrom, Miss. Marguerite Rut

      sex   age     fare  sibsp  parch
0    male  22.0   7.2500      1      0
1  female  38.0  71.2833      1      0
2  female  26.0   7.9250      0      0
3  female  35.0  53.1000      1      0
4    male  35.0   8.0500      0      0
5    male  54.0  51.8625      0      0
6    male   2.0  21.0750      3      1
7  female  27.0  11.1333      0      2
8  female  14.0  30.0708      1      0
9  female   4.0  16.7000      1      1



The `na_values` argument allows you to specify additional strings that should be recognized as `NaN` (Not a Number) in your data. You can provide a scalar, a list of strings, or a dictionary for column-specific NA values. By default, pandas already recognizes a standard set of strings as `NaN`.

In [60]:

url = 'https://calmcode.io/static/data/titanic.csv'
data_na_values = pd.read_csv(url, na_values={'age': 'unknown'})
print("\nData after specifying 'unknown' as NA value for 'age' column:")
print(data_na_values.head())

Data after specifying 'unknown' as NA value for 'age' column:
   survived  pclass                                               name  \
0         0       3                            Braund, Mr. Owen Harris
1         1       1  Cumings, Mrs. John Bradley (Florence Briggs Th...
2         1       3                             Heikkinen, Miss. Laina
3         1       1       Futrelle, Mrs. Jacques Heath (Lily May Peel)
4         0       3                           Allen, Mr. William Henry

      sex   age     fare  sibsp  parch
0    male  22.0   7.2500      1      0
1  female  38.0  71.2833      1      0
2  female  26.0   7.9250      0      0
3  female  35.0  53.1000      1      0
4    male  35.0   8.0500      0      0

In [61]:

data_na_values_list = pd.read_csv(url, na_values=['', '#N/A', 'N/A', 'unknown'])
print("\nData after specifying a list of NA values:")
print(data_na_values_list.head())

Data after specifying a list of NA values:
   survived  pclass                                               name  \
0         0       3                            Braund, Mr. Owen Harris
1         1       1  Cumings, Mrs. John Bradley (Florence Briggs Th...
2         1       3                             Heikkinen, Miss. Laina
3         1       1       Futrelle, Mrs. Jacques Heath (Lily May Peel)
4         0       3                           Allen, Mr. William Henry

      sex   age     fare  sibsp  parch
0    male  22.0   7.2500      1      0
1  female  38.0  71.2833      1      0
2  female  26.0   7.9250      0      0
3  female  35.0  53.1000      1      0
4    male  35.0   8.0500      0      0



The `skip_blank_lines` argument (which is `True` by default) determines whether blank lines in a delimited file should be skipped. Setting it to `False` will cause pandas to read blank lines as rows filled with `NaN` values. This argument is primarily used with text-based files like CSV.

In [62]:

url = 'https://calmcode.io/static/data/titanic.csv'
data_skip_blank_lines = pd.read_csv(url, skip_blank_lines=True) # This is the default behavior
print("\nData after skipping blank lines (default behavior):")
print(data_skip_blank_lines.head())

Data after skipping blank lines (default behavior):
   survived  pclass                                               name  \
0         0       3                            Braund, Mr. Owen Harris
1         1       1  Cumings, Mrs. John Bradley (Florence Briggs Th...
2         1       3                             Heikkinen, Miss. Laina
3         1       1       Futrelle, Mrs. Jacques Heath (Lily May Peel)
4         0       3                           Allen, Mr. William Henry

      sex   age     fare  sibsp  parch
0    male  22.0   7.2500      1      0
1  female  38.0  71.2833      1      0
2  female  26.0   7.9250      0      0
3  female  35.0  53.1000      1      0
4    male  35.0   8.0500      0      0